[["rheinl", "I am an \"industry folk\" (invited to townhall presentations / done projects with students). Would say the difference in skillset is quite startling. SMU students are generally better at softskills but ask them to explain the methodology behind their work and you will get fluff + the occasional \"actually our prof gave us the equation\"\n\nNUS students are no slouches in the presentation department but umm... there is a clear vibe difference. They generally come across as less polished. But its quite obvious their projects are not the cookie cutter template provided by a prof, the students really really know their shit", [["aa0n_", "I see, could you explain a little bit more how NUS students are less polished? "], ["chiotkk", "Opinions about NTU?"]]], ["fouratetwo", "SMU IS student here. Ask yourself what you want to do for a career.\n\nA career in IT/IS that wants to deal consultancy/sales relating to IT? Go for SMU, since their curriculum is structured/focused that way. Not too technical, but not too easy either.\n\nDo you want to be more hands on/technical? Go for NUS.", [["aa0n_", "Is it really just consulting and sales? I intend to go into either FinTech or Data Science/Analysis.", [["fouratetwo", "Thats just generalising it because from the modules I have taken, after the foundations, most modules are about how IT and business come together.\n\nThere other niche tracks as you mentioned, FinTech and Data Science etc. But if you really want to be of value in these areas you have explore it on your own, this means internships/external projects/upgrading yourself. The modules here are definitely insufficient when you want to go out and work in these industries. \n\nAs one of them mentioned here, the uni you go to dont matter as much if your experience and skills are of a standard. However, if you're looking for a uni that will give you a solid technical foundation, I highly suggest NUS. \n\nThat being said, it all boils down to what kind of uni and learning experience you want, and what you hope to achieve at the end of it. ", [["aa0n_", "I agree, real world experiences are definitely crucial out in the workforce.\n\nPersonally, I'd much prefer the seminar style of teaching, as I definitely retained information better in a smaller classroom. But it could be possible that I was just lazy and immature back in my JC days and chose to not listen in lectures. How's the seminar style doing for you?\n\nI've also heard that by the year that I'd enroll, 2018, SMU has a new syllabus whereas I can either take more modules in the computing side, business side or have a balanced syllabus. I wonder how that would compare to your current syllabus?\n\nAlso, how's your school life! I've only heard from the people that represent SIS in the open houses, and haven't got the opportunity to listen to opinions from others, other than \"omg IS is so hard good luck fam\".\n\nLastly, is it true about the GPA situation as I've stated in the main post? Thanks, and sorry for the long post!", [["fouratetwo", "The smaller classroom is not bad I suppose. The lecturers are more involved in the teaching and delivery. \n\nI have no idea about the new syllabus the school is planning, so I can't help you there. \n\nSchool life is how you want it to be. Join CCAs or clubs. You can also just mug all the way.  It is all up to you.\n\nFinally about GPA, it can be abit of sensitive talk in the school. For me, I think if you put in the right effort it is definitely there for you to score, and it is not as bad as they say. One thing to note is that its SMU, you got biz mods, so you got to excel in both the IS and Biz mods. I think the issue arise when you struggle with one of the two. So just be consistent when doing both and you should do fine. "]]]]]]]]], ["chiotkk", "I think with regards to Computing courses, you can place less emphasis on classroom environment/faculty quality, simply because of the large amount of resources available online. You're less screwed than if your ChemEng lecturer is garbage. That being said, the accreditation that comes with NUS Computing is hard to forgo. If competition is an issue, keep in mind that NUS Computing should be way more competitive than its SMU counterpart.", [["aa0n_", "I agree; I've been hearing that certain lecturers from overseas in NUS are pretty bad and it forces some of my friends to self study online or discuss with others. Pros and cons, I guess."]]], ["taggybadass", "SMU SIS focuses on both IT and sales-related area. This sounds nice but tbh it is hard to focus both and be adequately exposed to the IT side by the time you graduate.\n\nFrom what I have seen in the IT industry, consultancy jobs which require a higher amount of expertise on IT skills (algorithm efficiency, critical IT thinking etc...) do not often hire SMU SIS graduates. Hence if that is the path you wanna take, do consider NUS IS before SMU. ", [["aa0n_", "From your experience, is it better to have better marketing skills and such, but less technical skills — at the start, and in the long run; or vice versa?\n\nI understand that eventually computer scientists, engineers, data analysts and such, will hit a certain point in time where they take over managerial roles with less emphasis, but that's not to say technical skills aren't important, of course.\n\nThanks for your input anyways!"]]], ["crisseur", "I've heard that the computing students in NUS do not like their courses as much as NTU computing students do. I have friends in all local uni taking computing courses such as IS and I personally think you should go for SMU, judging from my friends' inputs.", [["aa0n_", "Agreed, this is what I've been hearing from multiple sources as well. Thanks for your input!"]]], ["KeythKatz", "NUS computing 100% no question\n\nOther local U shouldn't even be a consideration\n\nThe perception of your university degree is all that matters (exaggerating here so no nitpicking please) after you graduate. NUS > NTU > SMU for computing, so go for that."], ["BLOW_JOB", "Sorry but CS is the only real computing course. IS is so full of fluff, especially in NUS."], ["cheeselinn", "went thru SMU social sciences one but Ive heard multiple biz interview experiences. basically, you will be brought to a room where there are other interviees as well. It will be a group interview then there will a discussion about an article. Everyone will try to talk as much as they can (to get the profs good side). I suggest you speak up at every chance you get but don't cut off people as well. \n\nI know alot of people from a non-business background do well, so don't worry about knowing basic knowledge. Just show that you have passion for it. "], ["erblung", "Read up on current affairs and appear confident. \n\nIts a group interview, which means that 2-3 candidates would be interviewed by 1-2 lecturers. For my interview, they would throw a question across the board and asked each person what they thought individually. You can thus rebuke or support your peers' arguments.\n\nThey asked the following questions, in this exact order:\n\n1. Why do you want this course/Why did you choose SMU?   \n(Very simple question, just answer with passion. Naturally you should rehearse this with someone first)\n2. Current affair topic - If you want a hint, just read Straits Times headlines pertaining to politically correct topics from 2-3 months ago.   \nIf you ask me, I would say two very likely topics would be Cyber Security and the Malaysian water dispute. They are unlikely to pick anything too recent or controversial (I doubt the egging incident or LGBT issues will get asked) \n3. Do you have any questions for us?  \nThis is your chance to actually ask something you're interested in. At the same time, you can give your interviewer the vibe that you're really keen on joining SMU and you're asking about life at SMU as if you're already set on the place. \n\nSide note, if the current affair topic does turn out to be one of the two, do tell us haha\n\nRemember that the interview is yours to mess up, so get a good night's rest and enter the room with energy."], ["drigglecorrade", "if i remember correctly it’s like 8 people in a sitting? GL!"], ["poppycandy_89", "I was interviewed by LKSSB last Saturday. The interview is conducted by 2 profs, 1 assessing and 1 asking the qns. My group had around 10 people. Basically u are grouped in 10s and asked to read an article about something to do with current affairs (a specific topic) then going into the seminar room for the interview. This can only go in 2 ways, everyone is awkward and nobody wants to break the ice. My group had a couple of extroverts so we engaged in meaningful discussion. After going into the seminar room, the interviewer will ask everyone to briefly introduce yourself. After that, he starts to ask for our opinions about the article, whether we disagree or agreed. My points raised were generally sub par compared to the others and I knew I wasnt going to be accepted after hearing how outspoken everyone was. However i spoke 4-5 times during the interview. The interview generally is more of like a conference type discussion rather than an interview and its def not as stressful as compared to an actual interview. At the end, he asks a qn unrelated to the article which was \"should governments fund start ups?\" After completely smoking my answer, I knew I was screwed. However, I received the email of acceptance immediately the next day so I guess I got pretty lucky. Personally, i think it's more important that u try your best rather than giving perfect answers. I'm sure the reason I got in was because I spoke as many times as I could and tried my best to give a logical answer. Good luck for your interview, dont be phased by the outspoken ones!  Do dress in a formal office wear attire as majority of them wore that while I stupidly wore a polo shirt instead...\n\nPs you dont need to know about business or much current affairs."], ["iurnaux", "Had my interview last year, mine was a  group interview, think it was more than 10 individuals. I don’t think there’s a need to wear formal attire to show your professionalism. Smart casual (no jeans) should be more than enough as an attire for the interview. You can read up on current affairs but don’t expect too much from current affairs as the interviewers made out of 2 profs and practically conduct the interview on a topic you won’t be expecting. My topic back then was a topic revolving around the society forgetting the general elderly population. I guess you’re expected to contribute your thoughts firstly to address your stand point, whether you agree or disagree with the given topic. Remember to provide examples along with evidences to support your point. You can suggest newer ideas but do prepare for questions asked by the professors, likely to stimulate your critical thinking( there’s no right or wrong).\n\nThe atmosphere during the interview can be competitive but not to worry, the most important thing is to be as natural as possible and comfortable throughout. Do not be anxious if you don’t get a chance to voice out your points as everyone will get a chance eventually. Another point to take note, do not attempt to overshadow another interviewee as they speak as it is pretty rude for you to do so. Avoid rushing to answer your points as well if you get what I mean. Adding on points to other interviewees’ opinions or answers can be a plus point for you if you feel something’s missing."], ["djmatt85", "I won't comment on the preparation because other people have shared that already. Just a tip, there will be people who will hog the limelight and talk a lot. There are also some who are very quiet. Try not to be any of those students. What you want to aim for is a balance of both. Don't worry if you do not have any fresh points to share, you can always build on or challenge what others have already shared in a cordial manner. Look attentive when people are speaking, even when what the person is saying is nonsensical. \n\nLastly, be yourself. Be comfortable. The professors are really nice (even if some of them might have RBF)  "], ["karmaseeder", "What other choice do you have? \n\nEven for me personally as an NTU undergrad with scholarship I find this 4 years to be quite a waste of time. The teaching quality is so poor compared to when I exchanged abroad. \n\nAnd you better make strong networks cuz business degree doesn't really give you very deep hard skills", [["ZeroPauper", "I second your sentiments. [The quality of education in NTU(SBS) is so bad ](https://www.reddit.com/r/singapore/comments/adfygy/ntu_doesnt_provide_quality_education_and_heres_why/?st=JTN7P4TW&sh=d2286e28) that I question my decision to study here every other day. \n", [["ilovezam", "It's no better in NUS... A lot of the profs are really nice and helpful but somehow the lectures and material are just awful", [["ZeroPauper", "You know, a part of me really hoped that things was different over in NUS. Methinks at least some of us could get proper education. \n\nI’m sorry to hear that it’s shit over at NUS as well. I Guess the least we can do is to provide direct feedback with constructive criticism to the professors so that they might try to improve their teaching, if they even care about that at all.\n"]]], ["precipiceblades", "Especially after exchange. Like anywhere else in the world. "], ["Bleura", "SBS is biological science right? Damn Im choosing between nus and ntu for sci", [["ZeroPauper", "Yes. The choice is obvious tbh, I have already narrowed it down for you. \n\nhttps://www.reddit.com/r/singapore/comments/adfygy/ntu_doesnt_provide_quality_education_and_heres_why/?st=JTN7P4TW&sh=d2286e28"]]]]], ["None", "[deleted]", [["karmaseeder", "Finding your wife is well worth it imo\n\n"]]], ["nmnhnblm", "> teaching quality is so poor \n\nwhere did you do your exchange? i find it to be quite the contrary ", [["karmaseeder", "UC Berkeley\n", [["Enterland", "There's no doubt that UC Berkeley would be a better all-round university than NUS/NTU. No matter how you spin it around, ntu/nus can never compete with worldwide renowned Universities. ", [["karmaseeder", "But the gulf is just so wide. \n\nAnd didn't we beat them in university ranking? \n/sarc"]]], ["confused_cereal", "What's your major? I don't deny that teaching in local unis tend to.. leave more to be desired. But UC Berkeley is one of the top schools in US, in several fields it's comparable with MIT etc."]]]]], ["taenerysdargaryen", "NTU HSS grad here, completely agree with everyone who says the teaching quality is poor. So many profs just can't be arsed, and teach in a superficial manner. I had to go to very specific profs and push for their insight before I even learnt anything new. The general level of teaching really leaves much to be desired.", [["None", "[deleted]", [["taenerysdargaryen", "wow, you obviously know so much about how lessons are conducted. Except, you don't. I wasn't even referring to mass lectures, but small scale seminar sessions. The very fact that you dismiss the education given as \"outdated theories\" versus the need for \"cutting edge science\" tells alot about how you don't understand the issue at hand. Nobody was even asking for a spoonfeeding of information, that's not how university works. But if you've actually been in classes and interacted with professors, you should know that the reality is quite different."]]], ["AureBesh123", "Just because you uni was crap doesn't mean other unis aren't good.", [["karmaseeder", "Well, I can only hope this experience is confined to NTU then"]]]]], ["None", "> The teaching quality is so poor \n\nNTU grad here and I share the same sentiment."], ["AureBesh123", "Just because your uni was crap doesn't mean other unis are not good."]]], ["HelixLeon", "study hard for 4 years then get garmen job to relax and get high pay\ndun be like uncle me, never study hard and now struggling to feed my family", [["CDT157", "bars", [["HelixLeon", "sorry, what does bars mean?", [["seshs", "commonly used when words come out as sweet as chocolate bars : )"]]]]], ["pinkguyfriedrice", "> [HelixLeon](https://www.reddit.com/user/HelixLeon)2 points · [1 hour ago](https://www.reddit.com/r/singapore/comments/b5jbwl/whats_your_retirement_plan/ejdz2s9/)  \n>  \n>target  to retire at age 50 with 1 million dollar stock portfolio providing a  passive yearly income of 40k, which is about 3k+ a month  \n>  \n>along with a fully paid hdb flat, so free time focus on my hobbies  \n>  \n>currently I am about 1/3 there, need to work harder for next 15 years to hit target\n\nI literally came from that post and I see two contrasting comments by you lol. "], ["HelixLeon", "uncle me each month earn 2k only, every now and then wife complain to me money no enough, very stressful live\n\nregret never study hard and earn a local degree", [["WittyKap0", "Unker mai lai la 2k a month can hit 1 mil and retire by 50 meh", [["HelixLeon", "both me and wife working, total income about 4k\nwe spend about 3k to 3.5k per month\nso save around $500 to $1000 per month\nI invest all our saving into stocks, so far so good ", [["WittyKap0", "Well good luck man, I hope u have some cash for emergencies and to pick up stocks in the upcoming recession. "]]], ["HelixLeon", "anyway I unlikely to hit the target, but have a target is better than no target and being hopelessly poor forever"]]]]]]], ["ginn_n", "It's not so much getting the paper as the 4 years of opportunities and experience imo.\n\nYou'll be hard pressed to find a place in the industry that offers you the networking opportunities from a wide range of sectors (if you mix with people from different faculties) and a chance to go overseas, start your own projects, pursue your own interests etcetc.\n\nOf course, this is on the assumption that you enjoy some minimal interaction, making friends, have things you wanna do, places you wanna be. Some people enjoy the working life more than studying, but that's to each its own. "], ["ilovepinknips", "Contrary to what the government is peddling, a degree is important in Singapore. \n\nNo degree means lesser pay in most industries. That’s a hard fact of life. \n\nIt’ll help you open more doors for employment. \n\nIt’s only after a few years in the workforce that people don’t care about paper and focus more on what you’ve achieved. "], ["cragkonk", "it really depends on the individual. for some(me) it is a necessity as its a prerequisite to higher promotions, to others(say, a childcare teacher) experience may arguably be more important.\n\nso i think the right question is, do you have a better idea of what to do for 4 years instead of smu?"], ["marvinisarobot69", "University is not just about what job i can get later or pay. It is a magical period in life where you get to study all day, pursue knowledge, wisdom and skills, be free to have an all day long date , everyday with the girl of guy of your dream etc. i wish i can do it all over again", [["fermentinggg", "I learnt tons when I was in uni. I enjoyed the freedom in choosing what modules to take unlike in JC when I had to study just so I could do my A levels. Pursuing knowledge and learning from my profs (I was lucky that majority of my profs are awesome) were fun! I wasn't really thinking about career prospects. I did initially because all the chatter around me in my first year of uni was which degree would get better jobs. I ignored the chatter from year two onwards and just did whatever the hell I wanted. No regrets. "], ["zoinks10", "Who the fuck studies all day at uni? I spent my time making friends, playing sport and getting drunk. Shove in the occasional all nighter to do all the work you skived over the course of the month and it was all good. ", [["WittyKap0", "Singaporeans do, as you've no doubt seen. Even at overseas universities most study a lot harder than the other kids. "]]]]], ["Rayl24", "For education purposes, no.\n\nFor work, yes. No degree salary cap around 2.7-3k+ around the degree entry position for your field.\n\nDegree allows you to skip the 10 years and have new cap around 5-6k. By that point you should already know whether you have chance for another promotion and the need to study for masters. ", [["AureBesh123", ">No degree salary cap around 2.7-3k+ around the degree entry position for your field.\n\nBut but but...what about those \"financial advisors\" with only poly diploma but sporting Mercs and Rolex?"], ["danielling1981", "My first read thought you meant starting pay.\n\nBut you meant the upper limit after 10 years.\n\nActually upper limit not that low.\n\nEdit: after reading my own comment, you are right. Your figure is likely intended for Masses rather than above average.\n\nAlso depending on industry, certifications may be better than masters.", [["AureBesh123", ">Edit: after reading my own comment, you are right. Your figure is likely intended for Masses rather than above average.\n\nSMU biz got quite a fair few land front office IB positions. $5-$6k is like weekly salary.", [["WittyKap0", "Nah not weekly for sure. The most well paid IB jobs for fresh grads are about 10-11+k monthly base. Even with insane bonuses you won't hit 5k a week.\n\nMaybe if you are a super genius and join a hedge fund in the US which gives you 2 mil bonus a year. I don't know if that exists in Singapore "]]]]]]], ["odnap09", "Education is your key to success. When you have a degree, you can move the world with flying colors. You're living in the most expensive city and a very competitive place. I'm not saying that all degree holders are successful but having a degree is a personal achievement that nobody can take from you. Not all the people in Singapore has the chance to have a degree. For me, having a 4-yr degree is worth it. "], ["microtek789", "A degree is the new diploma now. It's almost essential if you're looking at progression into higher roles (ie: More pay)."], ["rancidangel", "Yes I need that higher pay"], ["None", "Yes and All the best in your future studies "], ["danielling1981", "Sadly that is pretty much the normal route now.\n\nUnless:\n\n1) you have special skills. Eg: not much people competing for your job.\n\n2) you are that good. E.g.: you already have an amazing portfolio for what you do.\n\nNote: amazing because having a portfolio now is in fact common.\n\n3) you are not going to climb the coporate ladder. \n\nE.g.: family business. Rich family no need to work. Have a disruptive idea that will work.\n\n4) you do not have much ambition. E.g.: 1.6 and Every year 50 dollar increment till death sounds ok to you.\n\nNote: not having a degree doesn't mean this is the expected path. But for typical average folks, this may happen. Even if you have a degree, this may still happen.\n\n\nBottom line: you do not NEED it but it's practically the starting line in white dollar path now."], ["AureBesh123", "Reading the comments here, seems like the takeaway is not that a university degree is useless. The common denominator is that NTU sucks. LOL"], ["LeanPenguin", "SMU is a career-oriented school whose graduates tend to land pretty good jobs. All of my friends who went there had decent or even amazing careers, while others who went to NUS/NTU had mixed outcomes. While I agree with the other users in this thread that the quality of education in NUS/NTU is trash compared to overseas universities (I've experienced both), I have a feeling SMU will be way better than NUS/NTU, though I say this without any first-hand experience.\n\nA degree isn't necessary for success, but it's definitely the easy way out. Going to uni buys you 3-4 years of extra time to learn and explore more opportunities, time that helps you figure out what you want in your life and career.\n\n&#x200B;"], ["chickencheesepie", "Not worth but no choice la.\n\nDon't forget other benefits like hanging out in a place full of other young kids.", [["MissCreepyStories", "Yeah. The number of times I heard ex-colleagues (older male uni grads, from 27 years old to late 30s) who remarked wistfully that uni was the best time to find a girlfriend.... presumably because they had fewer chances of meeting a large pool of young eligible single women once they started working."]]], ["friendsbyfate", "Yes if you want to work for gahmen"], ["Psynomia", "Honestly i personally find polytechnic more enriching than university. \n\nI studied in SP and NTU, and NTU gives me the impression of the following:\n\n1. Priority on research than teaching crew , which is understandable since ranking mainly is on research. Some prof just spam infor and read off the slides. Some prof are really good as well, so it really depends.\n\n2. Every module teaches as though the student only take one module per semester. So much information per module makes me feel suffocated and hard to digest the information. \n\n3. 2nd point leads me to this last point, every semester feels like a memory contest. I can only retain about 20% of what i learnt per semester, because there are just that much content per semester. \n\nSo unless you have a profound interest in research and studying, university study should not be the place for you to learn the ropes of what you need in the workforce. But if you are looking for a cert to boost your employment chance and salary compared to tertiary education, go for it like the typical Singaporean kid route."], ["wtflyingduck", "Whether it's worth it or not is very subjective, and the answer depends on the trade-off. Getting a degree does seem like the safe bet. Graduate, find a job, settle into a career. The alternatives to this are endless, you could be the next Jack Ma :) , or the next failed hawker ><"], ["l3orn", "It justifies higher pay , period "], ["doublemcspicy", "Hihi, SMU Business undergrad here in my final semester.   \n\n\nI think it really depends on your context and also what you wish to pursue in life?  \n\n\nContext:  \nIf money is tight and paying for school fees or even taking out a student loan is tough then I would reconsider taking a degree in a local U. You can opt for a private uni education and essentially cut short your degree to 2 years and enter the workforce sooner.  \n\n\nWhat do you want to do in the future:  \n1. You know what you wnat to do and a uni degree isnt necessary: dont go to uni  \n2. You know what you want to do and a uni degree will be beneficial: go to uni  \n3. You don't know what you want to do: go to uni, business is one of the most flexible courses with numerous disciplines (finance, operations, marketing, strategy just to name a few) it will be a good place for you to find out what you want to do/ dont want to do  \n\n\nI do admit that the quality of education leaves much to be desired but there are other things that you gain along the way, especially for SMU.  Some of the things you pick up can be said to be rather valuable and transferable life skills:  \n\\- How to present yourself  \n\\- Networking  \n\\- How to work with people  \n\\- How to speak and present well  \n\\- Exchange and some new experiences\n\n\\- Friends \n\n\\- A solid network  \n\\- Etc  \nThese might sound irrelevant but only when I went out to intern during my holidays did I realise the benefits.  \n\n\nA uni degree also does give you a certain base pay when you enter the workforce. For those who say that a uni degree from SMU/ NUS/ NTU is not worth the paper, it boils down to how you go about attaining the degree. CCAs, internship experience, and other stuff play a big role in determining your job/ pay in the future as well.  \n", [["iurnaux", "Can i ask what are the benefits your realised when you went for intern during your holidays?", [["shadowz0", "There are certain job roles that do not hire outside, internship is the only possible way to get in, unless you know somebody. Networking is the number one thing you need to do in university. Getting to know someone working somewhere important  can reap much more than just applying for that position alone. Social capita is worth more than any piece of paper, and university is the prime spot for to build on that"]]]]], ["S2Raven", "Go learn a trade then, get some hard skills"], ["zkh77", "A degree is important in Singapore especially from gov unis. Congrats on getting the offer. "], ["mcqueen88", "Why study Business? I think it's good for you to study at university if you don't have any marketable skills. If you start work with a diploma and NS experience you will get hosed in the job market. But just make sure you utilise your time properly in uni, it doesn't have to be 4 years of nothing but study and it should not be."], ["MissCreepyStories", "Those four years are not just for acquiring an education cert, but also to build networks. All those alumni connections will come in useful years later in the future (especially seeing that you are going for a business field)."], ["gilinbetray", "No choice. Without degree, starting pay for diploma holders only 2k plus. Progression definitely lose out to degree holders or even foreign expats. \n\nAlthough government say university not as important, but you see public service, without degree, there is literally no progression. Maybe ask your army regulars. \n\nYou want to retire taking a monthly salary of 6k or 20k? "], ["ditzydiva", "Recruiter here:\nA basic Business degree is worth it to open doors into companies and civil service (if you are looking for a cushy gig) . And SMU has a good programme. There are noticeable difference in the quality of graduates from SMU over the other local universities. More confidence in public speaking and presentation.\nRemember you have make the best of your education. So take all the opportunities for internships in real companies and take it from there.   "], ["flippingnoob", "Depends on what you want to do when you graduate? Engineering or something medical related? probably yes. Business or Comp Sci, prob not. "], ["lycanthrope1983", "SMU degrees are generally not worth the paper its printed on. Go ahead downvote me to oblivion but its the truth...."], ["sdarkpaladin", "To be honest, you could technically do without the degree. But unless you are incredibly good at what you do or start your own business, it would be better to have that degree."], ["None", "[deleted]", [["None", "Engineering doesnt require specialised knowledge? Dafuq\n\nTheres a reason bridges and buildings arent collapsing "]]], ["SiHtranger", "Isnt the piece of paper still consider as an investment. As someone only have a dip the starting pay difference is pretty huge. You are basically investing time in exchange for a better chance to get jobs and good pay.\n\nBut as many have said once you start the job all those paper qualification means nothing."], ["VictorGWX", "If you're in the creative industry I honestly think it's not worth it. Otherwise, probably no choice in sg but to get a degree otherwise there's a glass ceiling. "], ["wedtty", "I did not postpone my interview, so not help there sorry, but for social sciences, everyone has to go through an interview, regardless of whether your diploma is related or not. The interview is mostly to see if you'll fit in with SMU's teaching pedagogy.", [["pringleswanson", "alright, thank you! your help is much appreciated. (-: "]]], ["djmatt85", "Interviews can be postponed. Just call the Office of Undergraduate Admissions and they will change it. \n\nSource: Used to do the calling of candidates lol"], ["Neralo", "I had to postpone mine because they scheduled mine in the middle of confinement week in BMT. They rescheduled for a Saturday about a month later. Eventually got in too.\n\nNot sure if it’s changed but back then every SMU course had an interview, regardless of background. BBM here. "], ["shinylew_", "Same here too. I have a non-related diploma and applied for business management."], ["Bananazebrafish", "On a separate note do try your best to stand out or be scholarship worthy in the interview. This is the one of the interviews to determine if the school will give you a scholarship."], ["astralcsgo", "If it helps I postponed mine because it clashed with another Uni’s scholarship interview lol.\n\nJust give the Office of Admissions a call, they are really nice and understanding people. "], ["balibone", "I'm in NUS IS, year 2. What would you like to know?", [["lucario386", "I'm also in the same position as OP. May I ask what made you chose NUS over SMU for IS?", [["MC_JEEZY", "Same question! "], ["balibone", "Ultimately, I chose NUS because I believe the brand name is better in the long run. Locally SMU and NUS may be equal, but internationally NUS is still up there amongst all the local unis. Will be good in case you end up working overseas.", [["None", "[deleted]", [["balibone", "Absolutely not. There will be more than enough mods which will require you to participate, present in front of classes big and small, and also work in groups. You will get plenty of opportunities to exercise and improve your soft skills.\n\nThat being said, how well your communication skills become is a result of your own initiative and desire for improvement. Remember what you did wrong and what you could have done better as you take all the mods and improve on them as you go on to other mods. No amount of modules which force you to speak up will help you if you don't actively try to improve yourself. "]]]]]]], ["pladz", "I'm actually going in next year after ORD, if possible can you pm me the scope of the modules that would be covered in year 1, and if any prior programming knowledge is required? Thanks!", [["balibone", "I'll write it here so others can see. 1st year is CS and IS fundamentals. For the CS portion, this means programming methodologies (current language being taught is Java), discrete mathematics, data structures and algorithms. For IS portion, you can expect IT ethics and other conceptual stuff about IS. No prior programming experience is required. \n\nAs an IS student you are only required to clear 5~6 CS modules to solidify your CS fundamentals. Things get more exciting from year 2 onwards where you get your hands dirty doing stuff like enterprise applications development, and a lot of project based modules based around many areas where IT and business intertwine. Have a look at the IS curriculum webpage to get a better idea.", [["pladz", "Yep, saw the curriculum, got pretty excited.\n\nAny recommendations for specialisations ?", [["balibone", "Nope. I don't specialise, as is the case for most people. Up to you really."]]]]]]], ["None", "[deleted]", [["balibone", "You can start by reading my reply to the post above. In summary, you can look at it this way. \n\nIn CS, you learn a lot about algorithms, CPUs, operating systems, networking, cryptography, software engineering etc. Very long list. After you have learnt all this, you apply your strong CS fundamentals to a specific scope in CS, like AI, cyber security, networking, embedded systems etc. CS is not for the faint hearted. It is fucking hard.\n\nIn IS, you are only required to clear 5~6 CS modules to solidify your CS fundamentals. The rest will be IS modules and other modules you are required to take around NUS, like accounting, calculus and statistics. IS modules are very project based, heavy on writing, presentation and project documentation. Have a look at the IS curriculum webpage to get a better idea of the modules. \n\nBoth are different kinds of beasts. People say CS has a much heavier workload than IS. I don't deny that. CS is hardcore. All the CS modules I've taken have been quite challenging, and I only try to clear 1 or 2 per semester. Having said that, you also need to have very good communication and writing skills, and be a fast learner of different technological concepts to do well in IS. Good project management and time management is also key. \n\nI have seen both side of the fence. People who can't take IS and go to CS, vice versa. More often than not it's he latter. And then there are also people who can't take either and drop out of computing altogether. Because computing itself is just fucking hard.\n\n", [["None", "[deleted]", [["balibone", "Most people here came from JC. 0 knowledge about computer science."]]], ["tianlan44444", "Thanks for the sharing"]]]]]]], ["seacatos", "Compared to NUS School of Computing, SMU School of Information Systems definitely is more business oriented. It mainly trains undergraduates to be suitable tech consultants, like those in Accenture. Whereas NUS SOC, focuses more on in-depth computing topics.\n\nHope this helps.\n\nSource: I have friends that graduated from both NUS and SMU with the computing degrees, 3 years ago.", [["MC_JEEZY", "May I know if your friends have vastly different jobs? For me, I'm still interested in going into the business sector with this IS degree and therefore I'm wondering if the difference in school will make a big impact.", [["yipeeyup", "Some examples of jobs SMU IS grads are holding: tech consultant, project manager, product manager, software engineer, business analyst.\n\nSMU IS curriculum will not be sufficient to prepare and train you to go into technical roles. ", [["None", "[deleted]", [["yipeeyup", "Current student of SMU IS. The new curriculum for IS is very different, iirc you can choose between tech or business track. In my opinion, SMU IS focuses more on technical width than depth. For my peers who are interested in development, they will usually self-learn, take on external projects or internships in the relevant domain.\n\nWith just what I've learnt in school (i don't see myself doing any technical roles in the future), I am very comfortable with project and product management roles. I actually chose IS over biz and I'm glad I did that because being in IS gave me the technical edge for business-oriented roles especially in the IT industry."]]]]], ["seacatos", "This won't help much because those two friends started their own companies after graduation.\n\nBut from what I see, majority of IS grads from SMU are in technology consulting (Big 4 IT audits, Accenture, IBM), IT in banking and IT roles like analyst and project manager in other companies.\n\nLike another fellow Redditor shared, If you want technical skills, you have to pick it up on your own."]]]]], ["delulytric", "quite chill and helpful. got any tech-related issues on your projects they are willing to help to a certain extent (won't spoonfeed you, but will let you learn), quite positive for most parts la. i can say that snek level not as prominent and frequent as in business sch. opps.", [["melodyslt", "hi! not related to this post but i think you’re a student of IS so can you help me if possible? i got invited to this event: https://docs.google.com/forms/d/e/1FAIpQLSeD0hLRpUJSnyOpb8BTBA26aZN_CwtHimsUMXUK3jimPCPrXA/viewform\n\nbut i’m not free on that day due to other commitments, just wanted to know if this is compulsory? or is this part of actual orientation? will i be able to meet new friends if i don’t go for this event? thank you so much! really appreciate it :)", [["delulytric", "Uh I think its a new program rolled out by SMU. Back then its more of a welcome speech + tea reception. No tours or whatsoever. The thing you should 100% go is Meta camp follow them on IG @smu.metamorphosis. Your seniors/facil will send out around May/June period.", [["melodyslt", "oh! so it’s not a must to go for this event to make friends i assume.. thank you so much✌🏼🙏🏻"], ["angelalee55", "hi just curious, meta camp isit for all students? like are the people in your group from specific faculties or isit mixed across smu ?? (:", [["delulytric", "Meta camp for IS. Bondue for business. Other school got their own camps. \n\nEveryone mix together is FOC, got 3 rounds, you can go for one or can go for all three."]]]]]]]]], ["shimmynywimminy", ">5. Enter university under a course (that can accept the bad results) just for a degree for a job in the future. \n\nDo this. ", [["Makiwawa", "Best choice by far.\n\nretaking alevels is no easy feat. No joke, being in NS is going to make it very hard for you to retake your exams. You don't have access to as much material, you don't have your teachers as much, you don't have as many friends who are there to motivate you to study. Being tired after a day really drains the motivation to study.\n\nThat's not to say that you couldn't still try. It is rare that retaking in NS will denote for a big change in grades, but you could always try if you have the time to (depending on vocation)\n\nHowever as of now, getting into a course that will take your score should be the highest priority. Any university will do, doesn't always have to one of the big local Unis. Maybe its just me, but a first class honour from a smaller University is worth way more than some mediocre scored degree from a big university. \n\nIf money becomes an issue, a part time degree is a choice as well. This is tough, tougher than maybe even studying for A levels in NS. But we gotta make do with what we have to get by, eh?\n\nDon't let the poor results stand in your way. You still have a long life ahead and many chances to prove your salt. Keep your chin up and keep fighting!", [["alevelscrewup", "The reason I'm not sure about this choice is because of the fact that with my RP (71.25) the courses that I can attend are pretty limited. With such limited options available it probably would not even land me a good (decent/stable income) job in the long run.\n\nFor now I'll try applying and appealing for NUS Com Eng first. Thanks for the advice!", [["h333ll000", "my friends got into NBS w rp 70!!!! but got rejected by smu business :/"]]]]], ["suicide_aunties", "Agree. If you can do this, your grades aren’t that bad. I had to really fight hard via multiple appeals, multiple teachers’ recommendations, 99 percentile SAT to get into even the bottom course. I would take SMU if you can as it’s easy to double major in business or economics.", [["alevelscrewup", "Do you have any experience or know anyone who does SMU Business/Econs? If possible I'm probably only SMU Business, but with my bad RP (71.25) I'm unsure if they'll even consider me. I also heard that they have a pretty harsh interview process.", [["suicide_aunties", "Hmm you can try SIS or SOSS which may be more feasible, and take a double major in Business. There’s no real requirements to take a double major except number of mods. "], ["leafieeee", "Honestly your rank points aren’t that bad. Plenty of people with lower scores than you made it to local universities. \n\nIf you’re interested in SMU business&econs, just try and go for it! You got nothing to lose. If you dont make the cut, there’s still NTU (econs) and SUSS. It’s pretty easy to get into SUSS, it’s not as popular as the other universities but it’s still a recognised local university. Also, securing good internships during uni to gain experience will definitely help you a lot when you graduate! A degree from a prestigious university isnt all that matters. \n\nUltimately you spend 3/4 years studying in uni. Choose to go into what you’re interested in and makes you happy! You still have time to decide. \n\n\n"]]]]]]], ["nooooblet", "I am going to post this in response to one of the posters above but not as a reply because I hope you don't miss the message. \n\nIf you are really close to your JC teachers I have had friends who spent most of the NS time in JC consulting the teachers at night etc. and they are ok with it. perhaps bring the idea up with them. \n\nI suppose you are now in BMT if you do decide to retake A levels, you know what to do before you get your posting.... \n\nif however you feel that army life is for you and you really just can't study type (like just scrape into JC, borderline all the way). I'd suggest you sign on. \n\nalternatively, the others are pretty right at the end of the day a paper is a paper and that's all that matters. for most the actual major is irrelevant. ", [["alevelscrewup", "I'll talk to my PC about this to see what he thinks about this. In all honesty I'm probably gonna resort to signing on as the last resort because I don't really feel that signing on is my strong suit - though at least I know that it's always an open option.\n\nRegarding the paper is a paper thing, do you mean that employers don't really care about what your paper covers? (e.g. Business/CS)", [["nooooblet", "Please only talk to your PC regarding signing on. \n\n1. your PC probably doesnt have the relevant experience to tell you how important or unimportant a degree is.\n2. unless your PC is a super nice guy, telling him you intend to retake A levels may have neutral to negative benefits (at least at the BMT stage). I would recommend discussing this with whoever becomes your immediate superior in your unit. \n3. barring technical degrees such as engineering and mathematics, all degrees are more or less the same. A business major would end up competing with a science major for the same sales job or managerial position. Many firms, IMO, do not mind taking up people from different disciplines and without skillsets. Skillset can always be trained. while aptitude can be judged by your relative performance to your cohort. and attitude is just what it is. ", [["alevelscrewup", "If you put it that way, maybe I'll ask him regarding signing on towards the end. Thanks!\n\nRegarding skillsets, what do you mean? Like on-hand job experience, how fast you work?"]]]]]]], ["chanhongsen123", "Honestly, \n\nYour best bet is to apply to University.\nIf I were you, I would start by applying for degrees which you have a higher likelihood of getting, but make sure it's something you don't mind doing.\nThe important thing is to secure a a lot in a program you don't mind.\nSince you're in NS, you can apply for courses which you have a lower likelihood of getting next year (and if you get rejected, you will still have your a lot you secured).\n\nAlso, once you're in Uni, there is a chance that you can transfer course (do not bank on this, but know it is possible).\n\nIf I were you l, personally I would retake A levels, but as others have mentioned it may be extremely challenging depending in your posting, etc.\n\nA few years ago, in your exact same position, and trust me, you can still recover from this.\n\nIf you have any other questions/worries, feel free to PM me.\n\n", [["alevelscrewup", "The reason I'm not sure about this choice is because of the fact that with my RP (71.25) the courses that I can attend are pretty limited. With such limited options available it probably would not even land me a good (decent/stable income) job in the long run.\n\nFor now I'll try applying and appealing for NUS Com Eng first. Thanks for the advice!"]]], ["FunnyFiska", ">3\\. Find a full-time job outside of the SAF after NS is over. I have no idea how this will work - the only thing I have is an A-levels certificate (and a bad one at that). Are full-time job positions even open for people without a degree? Is that even a feasibility?\n\nI too screwed up my A-levels a long time ago. This was the path I chose - *only* after getting a diploma. \n\nMy original plan was to work full-time for a couple of years and then study once I had enough. But A-levels are useless, they're basically on par with O-levels on a resume, and at that level the pay *sucks*. If I wanted a decent enough salary to start saving up for a degree course, I needed at least a diploma. \n\n(Personally went with a private diploma because ain't nobody got time to spend 3 years in poly and honestly all I needed was the cert.) \n\n*Disclaimer* I also chose this path because my specific field of interest doesn't necessarily require a degree, not unless I want to advance into something like management. So think very carefully and do some research on what kind of career you want to pursue and what jobs you can see yourself in.", [["alevelscrewup", "I'll PM you more regarding this."]]], ["gxgx96", "First thing i would suggest is to reflect on your current situation. Just like you I was really burnt out with A levels as well. After NS I decided to do my best in school and leave behind any regrets. Currently in 2nd year private uni now, it seems that work experience matters more during your course of study. Figure out what you really want in the future and pick up whatever skills you can to get yourself more attractive to employers in the future. All the best! "], ["lycanthrope1983", "Sign on is good", [["guardingcat", "Is good but with a degree. Enter a degree course that accepts bad results. Maybe SIT? And sign on officer.", [["lycanthrope1983", "I had friends who sign on as A levels and did degree later. They matured more during army and became more adjusted in uni. Probably best for OP if you lack discipline and focus ", [["alevelscrewup", "Honestly right now NS doesn't seem appealing to me. I don't really enjoy the regimentation and the system in place. It's probably the last resort (albeit safest) option for me.\n\nHowever, I'll look more into this as I progress further into my 2 years of NS.", [["lycanthrope1983", "I think you need the regimentation and discipline offered by NS. It did wonders for me and I became more disciplined after NS when I went uni"]]]]]]]]], ["AntiTankBlitz", "Full time job, part time degree.\nBest if related or admin/office job that can contribute to an entry level position of that degree's career path.", [["alevelscrewup", "Could you perhaps give some examples regarding this? I'm interested to know more.", [["AntiTankBlitz", "what industry/job are you interested in?\nA quick example, like working as a office boy / admin assistant for a logistic/marketing/accounting firm while doing a part time degree in supply chain/marketing/accounting at a uni like sim/suss/mdis/kaplan etc. Even if the job is a 0 experience $10 per hour job, being in the relevant industry still helps in landing your first job after graduation.\n\nDo seriously consider the part time degree route over re-taking of A lvls and diplomas.\n\nLast note, option 5 is still better than the above.", [["alevelscrewup", "Re-taking A levels/diplomas is honestly one of the last few options that I would consider - mainly due to the fact that I'm not confident in churning out a successful result.\n\nI don't really have a true job interest in mind. The safest option would probably be to enter into a generic Business/CS/Engineering course for a generic job that's safe and ensures a decent salary for my future. \n\nI do have some slight interest in game design, but I've heard from my friends who attended that course that they regretted their choice and wished that they would have taken another option. ", [["AntiTankBlitz", "For cs and engineering, do take a look at the curriculum (the modules required) when deciding. If you are weak in math, algorithms etc, together with your lack of motivation, those courses can become a nightmare.\n\nIf you have 0 coding experience, and want a free & fun way to learn, try codecombat.com", [["alevelscrewup", "I'm decent (B/C on average) at math. Studying for math was pretty hard back then as well...\n\nI'll try codecombat first. Thanks!"]]]]]]]]]]], ["seraphim1234", "I’ll probably sign on and get saf to sponsor my studies. (Yup, money was an issue when I was your age)", [["alevelscrewup", "I'll talk to my PC about this to see what he thinks about this. In all honesty I'm probably gonna resort to signing on as the last resort because I don't really feel that signing on is my strong suit - though at least I know that it's always an open option."]]], ["S2Raven", "You didn’t mention what you want to do for a career. If you know what you want to do, that will help you narrow your focus and look for solutions. ", [["alevelscrewup", "In all honesty I'm still pretty unsure now. Right now I'm just seeing how NS is (and it isn't that good) and thinking of what I want to do in the future. But seeing as how I still couldn't come to a decision in the 2 years of my JC... I'm honestly pretty unsure. \n\nI'm probably just gonna settle for a 'general' degree like CS/Engineering/Business, though I doubt it'll be possible with my RP (71.25)."]]], ["mcqueen88", "Don't panic and rush into hasty decisions. \n\n1. signing on. Do you like being in NS? Talk to a regular and see what life is like, maybe he can even let you shadow him. \n2. Retake A levels, this is very difficult but it is a worthy path\n3. Foundation course abroad after NS, if you can afford to study abroad I think it's great. But why did you mess up A levels?\n4. finding a job outside NS, do you have marketable skills? Can you learn some?\n5. I think entering whatever NUS, SMU, NTU course you can is great! You can even change your major after your first semester. Chat to a prof about this. \n\nDon't worry. The future is bright!", [["alevelscrewup", "1. Honestly right now NS doesn't seem appealing to me. I don't really enjoy the regimentation and the system in place. It's probably the last resort (albeit safest) option for me.\n2. If my posting works out I'm considering this.\n3. I don't really think I can afford to study abroad. I could use my NS pay after the 2 years but that's probably about it. I messed up A levels due to my own mistakes - mainly burnout and stress with the lack of motivation. Coupled with the fact that I'm not really a smart guy to begin with (usually a B/C grade on average, rarely As), and this led to me getting my 71.25 RP.\n4. Regarding marketable skills, I'm not really sure what you mean about that (thus I assume I probably don't have them). Could you perhaps go into more details?\n5. I'll look into this as well. For now I'm probably aiming for a generic Business/CS/Engineering degree that allows entry into standard, safe jobs. ", [["mcqueen88", "4. If you start work as an A level holder, and you don't know how to do anything (like, you can't programme well, you cannot do marketing, you don't know copywriting... copywriting is hard, it's a skill) you won't make much money. You aren't very credentialed but certain fields are more informal and may hire you if you can demonstrate your skill. \n\n3. Don't think that! Your rank point isn't that bad anyway, I'm sure NUS or NTU will accept you. CS may be a bit hard to get into now, but you could try Mech engin or EEE, these usually have pretty low entry points (look this up my information is old). You can transfer if your grades are sufficiently good. "]]]]], ["stateofbrave", "Hi, was in a similar position like you last year (OK I'm a girl). I screwed up As, RP 68.6 with MTL. For me my dillemma was whether I could get into university, and whether I could cope. I really did not want to repeat As because I wasn't really a slacker, so I doubt I would have better grade after repeating and the whole As thing was damn sian.\n\nI didn't have a specific career interest either, so actually that was a good thing because I only had a few options to choose from. \n\nApplied to Engineering courses in NTU and to SUTD. Whatever course can accept my RP, just whack. \n\nAm studying in SUTD right now and really love my life. They let students explore their interests in their first year and choose their major in the second year. If you don't mind math/programming, can consider. For me I'm OK with math so I guess it worked out for me, but not as much for my friends with similar RPs as me. \n\nI feel uni studies is so drastically different compared to JC, in a way that I prefer. If you choose to go to uni, take a course you don't mind studying. If you hated science in JC, or are really bad at math for example, I advise don't take technical courses. \n\nAlternatively, an A level degree offers advanced standing on certain poly courses. So you only need 2-2.5 years to complete your diploma and start working if that is what you prefer.\n\nCan't comment on the other choices though. "], ["Qwertyk1ng", "71.25 isn't that bad tbh. I got around the same as u and managed to get into NUS. Plus since u r in army u have like 2 or 3 years to try and apply into a local uni? I only managed to secure a slot in NUS during my final year of serving the NS. Also I had a friend who entered NTU physics with 63 rp. "], ["neverspeakofme", "SMU lets you transfer or take a double degree relatively easily and doesn't look at your A levels. My friend got BBCCC? I think, and entered SMU social science. Did well in his first year and is now doing SMU law + social sci double degree, which is definitely a straight A course. \n\nEven if you don't want law, options like Business + accountancy (enter with SMU Biz, BBBCC can get in), Business + infosystems etc. are all very good. \n\nBut of course, this hinges on the fact that the As screw-up was a fluke and you are actually a straight As student.", [["alevelscrewup", "Unfortunately for me I don't think I'm a straight As student - I'm probably just your average B-grade student that's trying his best to not fail haha. \n\nSMU sounds like a pretty good choice. Could you ask your friend how SMU is like?", [["neverspeakofme", "Great profs, good opportunities, good jobs. No hall, not much student life."]]]]], ["maggeemee", "I enjoyed my time at SMU! Convenient location, slightly pricy school feels (but hey you are sitting on prime real estate surrounded by many shopping malls), good cheap food nearby and there is definitely time for CCA & non-academic pursuits. But there's one thing on my chest that I want to inform all prospective students considering admission into SMU - the Grade Point Average system (GPA)  \n\n\nSome background info: NUS and NTU adopts the CAP system when it comes to awarding the grade points for the grade you obtain for any gradable module. \n\n&#x200B;\n\nA 5.0/5.0 \n\nA- 4.5/5.0\n\nB+ 4.0/5.0\n\nB 3.5/5.0 \n\nand so on. \n\n&#x200B;\n\nThis cumulates after every semester. So if you take a 5-module semester and you score 4B+ and 1B, your CAP for that semester is \\[(4x4.00)+(1x3.5)/5\\] = 3.90. SMU on the other hand adopts the American GPA system and the points for each grade are as follow.\n\n&#x200B;\n\nA 4.0/4.0 \n\nA- 3.7/4.0\n\nB+ 3.3/4.0\n\nB 3.0/4.0 \n\nand so on. \n\n&#x200B;\n\nIt cumulates after every semester too. So taking the same grades as the above, your GPA would be \\[(4x3.30)+(1x3.00)/5\\] = 3.24\n\n&#x200B;\n\nHere's the tricky part. In NUS and NTU, scoring a 4.5/5.0 & above gets you a first class honours. 4.00/5.00 - 4.49/5.00 second class honours (upper). 3.50 - 3.99 second class honours (lower). In SMU, scoring a 3.80/4.00 & above gets you a Suma Cum Laude. 3.60 - 3.79 Magna Cum Laude, 3.40 - 3.59 Cum Laude and 3.20-3.39 High Merit (there's other terms for GPA below 3.20). And for SMU, a Cum Laude is equivalent of an Honours. So, imagine a student with all B+ graduates from NUS and NTU. He/she obtains a second class honours (upper) with a CAP of 4.0/5.0. But a student from SMU obtains a high merit with a GPA of 3.3/4.0. No honours.\n\n&#x200B;\n\nI feel that this unfairly disadvantages SMU graduates when it comes to applying for internships or full time jobs, especially in the public sector where sometimes having an honours degree gets you a higher starting salary as compared to a degree with no honours. I must state that grades are not everything. If you are capable/if you possess the desired skills/if you have good networks and if you pass your interview, getting your internships or jobs shouldn't be a problem. \n\n&#x200B;\n\nHOWEVER, there are many MNCs, banks and organizations that explicitly state on their graduate hiring page that they are looking for graduates with a good honours degree. Some, like a prominent real estate organization even explicitly wrote for their graduate position that they are looking for graduates with a \"Second Class Upper/Magna Cum Laude or equivalent\". Since Magna Cum Laude is behind Suma Cum Laude, they associate Magna Cum Laude as an equivalent to a Second Class Upper. A particularly bank even listed high merit as third class!\n\n&#x200B;\n\nTherefore, if you are A student, good for you. You don't have to worry, but if you are B or a B+ student, I would say you are much better off at NUS or NTU! To me, i think that the undergraduate modules in SMU are around the same difficulty as NUS or NTU (if anyone has done a local exchange, please let us know how you find the modules if both schools). I really don't see why an SMU B+ is worth less than a B+ elsewhere. Seems like some B+ are more equal than others. The issue to me lies in how the grade points are awarded to the grade. The gap between an A- 3.70 and B+ 3.30 is too wide, especially when a Cum Laude (Honours equivalent) is 3.40 and above. I feel that it would be more fair if SMU adjusts their B+ to 3.40\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;"], ["suicide_aunties", "That’s a really formal-sounding post. My time was SMU SOSS was really great, you definitely have a lot of time to pursue your own CCA interests. Uni life is really what you want to make of it really, whether pursuing good grades, internships, “elite” CCAs, sports and adventure, or volunteering."], ["elnln9", "current sophomore student\n\ninterview: think interviewers are looking for those who can speak coherently and understands the course. \n\nquestions asked (for econs and was like 4-5 years ago): what’s the correlation between economics and mathematics, and then some national policies questions \n\ntime for non academic activities: absolutely, 3~ hour lesson per module + 1-2 hours to catch up/revise or complete tutorials, and with 5 mods = 25 hours a week. slightly lower first few weeks and may get considerably higher 1-2 weeks before exam\n\nmods: well u can choose when and with which prof u wanna take but getting the module of choice is another story. however, you’ll get some preassigned mods for your first year. \n\nexams will be 50% or lower for your final grading and there’s some sort of presentation for each module usually 20-30%. oh yeah, class participation 10-20% and mid terms 20-30% ish as well. \n\nclass size: max 48 per class, no crazy big lectures \n\nschool fees: more than other local u :-) "], ["3quanimity", "I think the university is awesome, it's located right smack in the middle of town, it's pretty accessible. The Professors and faculty members I have met are amazing and if you're willing to ask, they will be willing to offer some help. Throughout your 4 years you will be required to complete a couple of things such as 80 hours of community work and [if I'm not wrong students are now required to travel overseas at least once, be it a study mission or an exchange program](https://www.smu.edu.sg/news/2018/03/23/smu-make-global-exposure-requirement-graduating-students). The downside is that food prices are slightly steeper because you are located in town.\n\nYes, you will definitely have time to pursue the things you want to do so long you plan it out. In SMU, you are required to bid for the modules (mods) you want in a particular term. You could choose to do lesser mods and focus on other things. However this would mean that you may have to overload yourself in the later terms. You can sign up for as many CCAs as you want. You only would need to commit your time if you make it up the ranks to the exco. But do ask during the [Vivace](https://www.home.smusa.sg/vivace-1)\n\nIt was pretty chill, it's most likely a group interview with a total of 5 students to 2 Professors. During my years, they would ask [Fermi Problems](https://en.wikipedia.org/wiki/Fermi_problem) and everyone would be given time to present their answers. There are no right or wrong answers, I believe the Professors are just looking at your thought process.\n\nAre grades a huge aspect of getting accepted?\n\nNah probably not. I suck at studying and still do. My PSLE score got me to normal academic, my N level results barely made it. I flanked my O levels big time, my GPA in Poly didn't even make the cut. I applied because because I had a huge interest in information systems back then.\n\nEdit : Added some links here and there.", [["vxrick", "Hi! Happen to see that you’re an infosys student! Can I ask how infosys is like? Do you do more data analytics or software and programming? Does it touch on the IT side more or data analytics? Sorry for the bombardment of questions! I’m considering soss or infosys this year 😅", [["3quanimity", "Hi, unfortunately I don’t think I’m in a good position to answer the question on the courses now. Because the curriculum and course structure have changed quite a bit. If you need more information, I’ll highly recommend you to [read up] (https://sis.smu.edu.sg/programmes/undergraduate/courses/electives) on the courses offered and head down to SMU’s open house that’s held between the [2nd to 3rd of March] (https://admissions.smu.edu.sg/openhouse/register) .\n\nDuring my studies, I did a mix bag of both analytics and software programming. I did not choose to focus on a specialisation as I wanted to pick up a bit of both to find out my interest.\n\n\nInformation systems is a really small family, compared to other faculties in SMU. When I was a freshman, my seniors were very helpful and would often provide tips on how to tackle problems such as bidding and even projects. Seniors also conduct student-led courses such as git workshops for the juniors. Most Professors and instructors are also approachable and friendly. While the student body is competitive, we’re (if not most of us) always open to help out one another. \n\n\nYou’re also highly encourage to actively participate in class during discussions as this is graded. And like any other major, there would always be tight deadlines which would at times require you to Stay In School (SIS) over the nights to meet your deadlines or to rehearse for your presentation. \n\n\nA word of advice is not to pick a major just because of the attractive renumeration they provide. I have seen a bunch of peers who did that and dropped out of the course after 1-2 years because of the lack of interest. Pick something that you’re interested in and work on it instead.\n\n\nIf you need more information you can drop me a PM.\n\n All the best!", [["vxrick", "Thank you so much! You’ve been a great help 😄"]]]]]]], ["HoseDownTheSkiMarks", "Graduated in 2017 here.\n\nA-level grades were not really important unless you were going for a scholarship. I understand that due to grade inflation and the university's growing popularity, it is getting harder to qualify. My interview was a group interview and not everyone spoke. I gave 2 succinct statements and passed. I'd later find out that some of my uni mates did not say anything during their interview at all( surprise surprise, they sucked at presentations).\n\nThe good thing about SMU is if you want to get a project off the ground, you can easily find like-minded competent individuals who can make it work. \n\nI must say that a lot of non-academic pursuits are only given lip service by the school. Expect very little support from the school for your projects. But it is an excellent place to learn to network and get to know people who will be helpful to you in the future. Still, you should be having some sort of active side hustle aside from your studies.\n\nI floated through SMU without really studying much and graduated with 3.3. I spent more time studying Japanese and going for CCA training because that was important to me."], ["humans_of_wakanda", "I forgot most of the questions asked during the interview so I don't think I can answer this.\n\n&#x200B;\n\nI feel that because SMU lacks hall life, it's hard to make close friends unless you actually make the effort e.g. actually ask ppl if they wanna meet up/go drinking etc (it's also hard to have one night stands). I feel that if I didn't actually make the effort, I probably won't be meeting up with anybody during the 4 month summer break and that's even after getting to know 200/300+ batchmates from orientation camps/events. But even though it's hard to make close friends, the people in SMU are generally nice, mature and easy to get along/banter, and there isn't much class/batch/school politics. There are def some pretty popz ppl in my batch, but I can't really think of anyone who's actually unpopular in my batch. I've heard of some snakes/freeloaders, hardly experienced that before but they exist so beware.\n\n&#x200B;\n\nAs mentioned previously, each module only takes up 3 hrs 15 mins, so even if you take 5 mods per sem (which is what I've been doing so far), you'll only have a total of \\~16 hrs of class time. Tbh that's not a lot of time. While some people prefer to have only 1 mod/class per day, I usually try to pack all 5 mods into 3 days, so that I can work on other stuff in the remaining 2 days. This means that I sometimes have 2 consecutive classes (e.g. 1 class from 12 - 3.15, and 1 class from 3.30 - 6.45) which can be pretty shag. \n\n&#x200B;\n\nThe modules themselves can be damn shag, especially when the deadlines are all in the same week (happened a lot of times already). Be prepared for late nights, and \"hell weeks\". And be prepared to cover your group mates' asses when you realize their work isn't up to standard. Even if you only need to do one segment of a group report, try to read through and digest your other group mates' content to make sure their stuff isn't actually bullshit. Even if your segment is properly done, if your other group mates don't do their segments properly your overall group report grade will be shite, which means your grade will be shite. \n\n&#x200B;\n\nIf you want to make the most of your SMU experience, I would suggest joining multiple orientation camps (I joined 6 lmao), CCAs you are actually interested in, study hard while still making time to meet new people."], ["wakkawakkaaaa", "SMU if you're more business inclined and you can take 2nd major from any other faculty. NUS if you're more technically inclined. \n\nOne thing to note is that the culture and pedagogy is very different in the 2 schools though. SMU does all its classes seminar style (smaller class size, attendance/class participation is marked) while NUS is the typical lecture (which sees people skipping all the time) + tutorials. Culturally, you'll miss out the hall/hostel life in SMU but the location is superb. \n\nAll in all, both courses are good courses and you can't go wrong with either one if you're interested in IS.\n\nEdit: Extra stuff to note - nus average salary is slightly higher and SMU tuition fee is higher (if you don't factor in NUS student residency) ", [["Ravunesh", "aight thanks for ur input man !"]]], ["None", ". "], ["tedchill", "Of course NUS", [["Ravunesh", "but SMU seems to have more benefits like higher pay and employment opportunities", [["tedchill", "That's true for some business majors for undergrads, if you are a grad student for IS, I personally think that NUS is a better option"], ["Pesantkie", "I saw NUS IS salary they are higher than those from SMU IS \n\nThe speaker from NUS said look at the gross employment survey rather than those from SMU website itself. "]]]]], ["None", "[deleted]", [["wakkawakkaaaa", "Regarding the honours, you're comparing apple to orange though.\n\nI think it might actually be harder to get honours in SMU (in SIS at least). To get a cum laude you'll need to get higher on average than a B+ while a B+ gets you a 2nd upper, you get the drift. \n\nAnd well... There's still B3 for alcohol, lol. "], ["Cheeselover99", "Thkz so much for ur detailed reply! But i dont really understand how the direct honours part works? Do u mind explaining further? Like is only cum laude considered honours? But for that you need to get at least gpa 3.4 tho! ", [["None", "[deleted]", [["Cheeselover99", "But i heard its really hard to get cum laude :( like only 30% gets that and above? Then the gamble is that if u get below that its q bad but if u get cum laude its vv rewarding?"]]]]], ["Sproinkerino", "If I'm not wrong SMU gives extra credits for A+ which leads to competitiveness. Whereas in NUS , A and A+ no difference\n\nNot putting you guys down but I feel that the pros and similar to both Ntu NUS since most biz sch have adopted seminar style. However it's a fact that SMU students tend to be more well spoken\n\n"]]], ["GrammarNaziii", "Graduated there in 2012 - SIS.\n\nDon't know if I'm just brainwashed by SMU but I do feel there is some truth that a higher percentage of their graduates get a job within a few months of graduating compared to other unis (I got my job offer in October 2011 - 8 months before graduation).\n\nDo take note that IS graduates are usually hired faster because there are less of them, comparing to School of Business here.\n\nI didn't have a lot of interactions with Accountancy students but from what I saw - they had to study a lot of hours. Your first few years on the job (assuming accountancy related / at an accounting firm) will also probably be very shitty - as in long work hours for mid pay. But if you work hard and rise through the ranks it can be very rewarding (but still with shitty hours).", [["Cheeselover99", "Oh i see thkz! R the ppl there nice? Or is it v competitive and the ppl there v attention hungry?", [["GrammarNaziii", "Any school you attend will have competitive / attention hungry / [insert person type] people. Don't sweat it, if you work hard you'll do well.", [["Cheeselover99", "Oh yeah true thkz!"]]], ["CavalryMaid", "It's as competitive as you make it out to be. I was from Biz/Acct and there was the usual spectrum \\(bell\\-curved of course, lol\\) of people. You have both extremes \\- the ultra competitive and ultra laid\\-back sort \\(more of the former though\\) but most people you meet ought to be normal \\(perhaps slightly more ambitious than the average Singaporean, which is not a bad thing\\).", [["Cheeselover99", "Oh i see but does accountancy have like less focus on presentations as compared to biz? ", [["CavalryMaid", "Yes. The grading is more weighted towards exams and less presentations. I've also noticed that low-effort presentations tend to not be graded down as much compared to biz (as long as your material is still correct, that is)"]]]]]]]]], ["try__harder", "- IMO some profs are quite elitist, I'm the cannot study type so I never got a chance at scholarships. \n\n- exams are competitive; b+ average doesn't grant you good honors. then again I've seen insane people from Nus SoC (e.g. people in steven halim's class, double degree program) who will rekt the bellcurve at smu anyway; I think the difficulty is around the same depending on your inclinations. \n\n- friends wise was good to great, went on a cray cray grad trip with my fyp groupmates, they weren't singaporeans and we flew around and visited each other hometowns.\n\n- exposure was great - two overseas trip; exchange, ocsp and alot of internships\n\n- career wise is not bad, got two job offers a year before graduation; one at a BB. starting pay for both jobs were/are close to 5k. \n\n\ntldr; if you get honors you get a good life. if you fuck up .....", [["Cheeselover99", "Is it really bad if you dun get honours? I heard its like taking a gamble.. but how abt direct honours? What award qualifies as honours tho? Cum laude? ", [["try__harder", "- SIS is compulsory direct honors. \n- There are people who do honors but not grad with good honors. good honors is classified as cum laude and above (according to GES). \n- no its not \"really bad\", many people with 3.0 averages get jobs at the big 4 and IT consulting firms like accenture that pay like 3-3.8k. \n- there are also quite alot of outliers who got 4.5k+ starting pay with normal honors (e.g. vmware)\n- it just \"feels bad\" because people are lame and benchmark success as getting a banking related job    \n- forgot to add an important detail: there was alot of emphasis and funding for innovation (startups)\n- while my grades are bad, I have profs who want me to continue projects I did for classes (with funding). \n\ntldr; appreciated my time at smu"], ["wakkawakkaaaa", "SMU\n\nMerit = 3.0+\n\nHigh merit = 3.2+\n\ncum laude = 3.4+\n\nMagna cum laude = 3.6+\n\nSumma cum laude = 3.8+\n\n\nB+ = 3.3 \n\nA- = 3.7\n\nA = 4.0\n\n\nNTU/NUS\n\n3rd = 3.0+ \n\n2nd lower = 3.5+\n\n2nd upper = 4.0+\n\nFirst = 4.5+\n\n\nB- = 3.0\n\nB = 3.5\n\nB+ = 4.0\n\nA- = 4.5\n\nA = 5"]]]]], ["gobgobgobstopper", "smu econs - just graduated last year. \n\nsmu culture wise, as cliche as it is, it's really how you make out of it. i managed to find a steady circle by participating in camps/being a faci etc. no doubt there are power hungry/attention seeking people around, but if you just do your due diligence, you'd find people you really can rely on! (at least for me) \n\nas much as i suffered in smu (sorry not GPA centric at all), i have to say smu did help me find a solid group of friends. grades/job wise, graduated with a gpa of 2.28 (as much as i tried, i was a B/C type of student :( ) but managed to find a job that pays pretty decently for these grades and within 3 months. it was the internship-centric culture that really helped me a lot here as well.\n\ntldr, dont fret too much and just enjoy the process! ", [["CavalryMaid", "Would you mind sharing what field you work in? I graduated in 2013 and those with suma were all moaning about how difficult it was to find jobs. I had gpa of 3.6ish and it took me almost 5 months to get something, and I pretty much took that job out of desperation .."], ["Cheeselover99", "Oh i see thkz for ur reply! "]]], ["xLANKWAIFONG", "I myself am from SMU, school of accountancy.\n\nFrom what I heard, the good accountancy and business professors originally from NTU’s biz sch were uprooted to NUS. When SMU was formed, the professors were once again uprooted to SMU. \n\nYou can ask some of the profs and they’ll tell you they were originally teaching at NUS.\n\n\nIn my opinion, I personally think SMU functions as a better business school as compared to the other two universities. \nIf you graduate with a bachelor in accounting, you are also exempted from many papers in the future to become a qualified accountant.\n\nSMU also boasts that it has the 1st accountancy course in Asia. (Not sure how true this is)\nMany national and international business competitions are won by SMU students instead of other university students, which to me is an important point to note to show how the school fares amongst the other Unis.\n\n\nThe culture here is reflective of the competitive culture faced in the workplace and the school actively promotes investment and entrepreneurship, if you’re into those type of things.\nGranted however, I have heard from NUS students who came to SMU to do local exchange that SMU is definitely much more competitive in nature.\nHowever, they have also mentioned that it’s more ‘happening’.\nThe friends you make are entirely up to you. Personally, I think due to the competitive nature it’s a little more cut throat and difficult to find trustworthy friends. (But of course, you still can find these friends, it’s who you mix with) \n\n\nOverall, think the school is pretty good at equipping you with the ability to talk very well. Academic wise, it doesn’t lose to NUS or NTU grads at all, since the syllabus is pretty much the same.\n\nPersonally, I really enjoy SMU and think it’s the best course amongst the 3 U’s.\n\nI would suggest considering between SMU and NTU, only because NTU is a 3-year course.\n\nHope this helps. Feel free to reply or message if you have any questions.", [["Cheeselover99", "Thkz for ur detailed reply!! Um like in my pov accounting mainly deals with numbers so regarding class participation weightage is it not as heavy? Also since its a seminar style of teaching the prof will see teach rite? Or will they only mention the basics and only by asking qns can u really learn? ", [["wakkawakkaaaa", "There's stuff like case studies too, especially with topics such as fraud, audit and regulations. "], ["xLANKWAIFONG", "For accounting modules, yes I would say those mostly deals with numbers. \nWhile there is still class part weightage, it’s not so much focused upon for these modules. \n\nBut there are still core university modules which you would need to take that has class part weightage and require more participation. \n\nDon’t worry, they do teach you quite in-depth for accounting modules. You don’t need to constantly ask questions, but you still need to do your consistent work to understand as they move fast."]]]]], ["gobgobgobstopper", "i did econs/HR. i wasn’t interested in finance at all so i guess an “easier” 2nd major did help. and also with my shitty grades, i chose not to go for exchange and took an LOA, in hope it would help. so i guess it kinda helped me too! ", [["Cheeselover99", "Okay thkz for ur reply! "]]], ["pokemonstersg", "My 2 cents/impression I get ..they've got a decent career office I reckon ..helping students to source internships vs other unis... which is important....as honestly what one learns in school often doesn't translate to the real world anymore where knowledge is aplenty online etc", [["Cheeselover99", "Oh i see.. thkz for ur reply!"]]], ["Thesinz", "Anyone with views on SOSS with relation to the social science faculties of other schools?", [["javng", "SOSS student here, last semester. \n\nThe put things succinctly, SOSS is great because you can literally become anything you want. You aren’t tied down by what you study. I have friends working in banks, as Teachers, Researchers, FMCGs. The list is endless. The flip side, you have to work a lot harder for people to take you seriously. \n\nIt’s easy to pursue academia if you are interested as well. We have a through train fully sponsored psychology Masters program that is just an additional year to your undergrad (if your grades are good enough). \n\nAnd in my very biased opinion, most of my friends are all employed even before we graduate, which is relatively rarer for my other friends in the other unis. But take this with a pinch of salt! Might just be availability bias on my part. \n\n"]]], ["troublesome58", "bunch of folks who spend more time dressing up (themselves and the work) than getting actual work done.\n\nPlenty of meetings just to decide the style of a ppt slide.", [["pokemonstersg", "then again actually doesn't this happen a lot in real life office politics too heh..harsh reality of life...often important to \"be visible\" not work hard  =(\n"], ["ambidextrous12", "In other words the perfect set of skills to become yet another corporate drone. If you're more academically inclined and want to pursue research or further studies (for whatever sadistic personal reasons), then hard to beat NUS. If not NUS Biz and SMU are on par I'd say."], ["hungrymao", "no shit my office roommate was from smu and apparently she was famous for wearing a white cheongsam for presentations.\n\nin the office she's known for dressing like a ktv hostess. not much has changed. /shrug", [["woonsim", "I'm hella curious about her major and line of work. Like when and where is it ever appropriate to dress like a ktv hostess in the office", [["hungrymao", "Law. We are both lawyers in a law firm, go figure. \n\nAlso: attention seeking + tacky fashion sense lor ¯\\_(ツ)_/¯ I mean she did used to wear a white cheongsam for presentations... ", [["LimbRetrieval-Bot", "You dropped this \\ \n *** \n^^&#32;To&#32;prevent&#32;anymore&#32;lost&#32;limbs&#32;throughout&#32;Reddit,&#32;correctly&#32;escape&#32;the&#32;arms&#32;and&#32;shoulders&#32;by&#32;typing&#32;the&#32;shrug&#32;as&#32;`¯\\\\\\_(ツ)_/¯`&#32;or&#32;`¯\\\\\\_(ツ)\\_/¯`\n\n [^^Click&#32;here&#32;to&#32;see&#32;why&#32;this&#32;is&#32;necessary](https://np.reddit.com/r/OutOfTheLoop/comments/3fbrg3/is_there_a_reason_why_the_arm_is_always_missing/ctn5gbf/)"], ["woonsim", "Lawl ~~sorry I had to~~ I didn't expect this"]]]]], ["troublesome58", "It's okay if she is hot."]]], ["Flocculencio", "So basically life skills lah. "]]], ["None", "[deleted]", [["Polymath_B19", "That isn’t correct at all dude... ", [["None", "[deleted]", [["Polymath_B19", "Just because NUS didn’t sub-divide the grades above 4.0/5.0 into as many categories as SMU, doesn’t mean SMU’s B+ average is called a third-class honours equivalent. \n\nIn fact... doubt any university calls B+ average “third-class honours” \n\n", [["None", "[deleted]", [["Polymath_B19", "Most local HR thinks a B+ average is third class honours? I wonder how you gather that information... because a simple ordinal ranking way to look at this is insufficient and incorrect really. \n\nAnd are you saying that because you are in HR and you know all of the NUS/NTU/SMU grading system well? ", [["cedrizzy", "Actually it's worse than what he has described because of the honours system. Just by being the 50th percentile would mean that you simply don't qualify for any of the honours scheme."]]]]]]]]]]]]], ["kitsuneconundrum", "my management trainee kids under me from smu perform no differently from any other place."], ["vendustreek", "It's really competitive and business centric. If you want to do any learning out of finance or business, it's average. A lot of study spaces but some of the spaces lack practicality. School spends money on some things that don't make sense or function in the long run. Personally, found a steady group of friends and managed to avoid any type of social circles I disliked. \n\nCareer centre wise, it's good although I don't know if it's better than NUS or NTU. There are career coaches who you can book an appointment with just to edit your resume and cover letter. You can also have mock interviews. We also have compulsory 'career' classes. Like how to dress for an interview and what your resume should look like etc. However, sometimes the career centre staff are inefficient and really don't help. The different departments also have bad communication between them, like things don't get passed on or differing rules.\n\nIt'll be normal for students to do like 4 internships during your study here. Leave of Absences to do internships are also getting more common. Helps with the resume I guess.\n\nDidn't do Accountancy, so can't help you there buddy."], ["MinisterforFun", "I don’t study there but I applied there. Twice. Twice I got rejected and twice they didn’t even have the basic courtesy to notify or send me a rejection email.\n\nI’m not salty about the rejection. I’m salty about their snootiness or whatever you wanna call it.\n\nI mean, although in their eyes I’m not good enough for them, first impressions *do count*."], ["wweixiangg", "nice try pauline ", [["Cheeselover99", "?"]]]]